7767517
237 286
Input                    in0                      0 1 in0
Convolution              conv_24                  1 1 in0 1 0=36 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=972
Split                    splitncnn_0              1 3 1 2 3 4
Permute                  permute_83               1 1 4 5 0=3
LayerNorm                ln_66                    1 1 5 6 0=36 1=1.000000e-06 2=1
Permute                  permute_84               1 1 6 7 0=4
Split                    splitncnn_1              1 2 7 8 9
Slice                    chunk_0                  1 4 8 10 11 12 13 -23300=4,-233,-233,-233,-233 1=0
ConvolutionDepthWise     convdw_139               1 1 10 14 0=9 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=81 7=9
Pooling                  amp_115                  1 1 11 15 0=0 18=257 7=1 8=360
ConvolutionDepthWise     convdw_140               1 1 15 16 0=9 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=81 7=9
Interp                   upsample_nearest_0       1 1 16 17 0=1 3=514 4=720 6=0
Pooling                  amp_116                  1 1 12 18 0=0 18=128 7=1 8=180
ConvolutionDepthWise     convdw_141               1 1 18 19 0=9 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=81 7=9
Interp                   upsample_nearest_1       1 1 19 20 0=1 3=514 4=720 6=0
Pooling                  amp_117                  1 1 13 21 0=0 18=64 7=1 8=90
ConvolutionDepthWise     convdw_142               1 1 21 22 0=9 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=81 7=9
Interp                   upsample_nearest_2       1 1 22 23 0=1 3=514 4=720 6=0
Concat                   cat_0                    4 1 14 17 20 23 24 0=0
Convolution              conv_25                  1 1 24 25 0=36 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1296
GELU                     gelu_50                  1 1 25 26
BinaryOp                 mul_0                    2 1 26 9 27 0=2
BinaryOp                 add_1                    2 1 27 2 28 0=0
Split                    splitncnn_2              1 2 28 29 30
Permute                  permute_85               1 1 30 31 0=3
LayerNorm                ln_67                    1 1 31 32 0=36 1=1.000000e-06 2=1
Permute                  permute_86               1 1 32 33 0=4
Convolution              conv_26                  1 1 33 34 0=72 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=23328
GELU                     gelu_51                  1 1 34 35
Convolution              conv_27                  1 1 35 36 0=36 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2592
BinaryOp                 add_2                    2 1 36 29 37 0=0
Split                    splitncnn_3              1 2 37 38 39
Permute                  permute_87               1 1 39 40 0=3
LayerNorm                ln_68                    1 1 40 41 0=36 1=1.000000e-06 2=1
Permute                  permute_88               1 1 41 42 0=4
Split                    splitncnn_4              1 2 42 43 44
Slice                    chunk_1                  1 4 43 45 46 47 48 -23300=4,-233,-233,-233,-233 1=0
ConvolutionDepthWise     convdw_143               1 1 45 49 0=9 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=81 7=9
Pooling                  amp_118                  1 1 46 50 0=0 18=257 7=1 8=360
ConvolutionDepthWise     convdw_144               1 1 50 51 0=9 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=81 7=9
Interp                   upsample_nearest_3       1 1 51 52 0=1 3=514 4=720 6=0
Pooling                  amp_119                  1 1 47 53 0=0 18=128 7=1 8=180
ConvolutionDepthWise     convdw_145               1 1 53 54 0=9 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=81 7=9
Interp                   upsample_nearest_4       1 1 54 55 0=1 3=514 4=720 6=0
Pooling                  amp_120                  1 1 48 56 0=0 18=64 7=1 8=90
ConvolutionDepthWise     convdw_146               1 1 56 57 0=9 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=81 7=9
Interp                   upsample_nearest_5       1 1 57 58 0=1 3=514 4=720 6=0
Concat                   cat_1                    4 1 49 52 55 58 59 0=0
Convolution              conv_28                  1 1 59 60 0=36 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1296
GELU                     gelu_52                  1 1 60 61
BinaryOp                 mul_3                    2 1 61 44 62 0=2
BinaryOp                 add_4                    2 1 62 38 63 0=0
Split                    splitncnn_5              1 2 63 64 65
Permute                  permute_89               1 1 65 66 0=3
LayerNorm                ln_69                    1 1 66 67 0=36 1=1.000000e-06 2=1
Permute                  permute_90               1 1 67 68 0=4
Convolution              conv_29                  1 1 68 69 0=72 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=23328
GELU                     gelu_53                  1 1 69 70
Convolution              conv_30                  1 1 70 71 0=36 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2592
BinaryOp                 add_5                    2 1 71 64 72 0=0
Split                    splitncnn_6              1 2 72 73 74
Permute                  permute_91               1 1 74 75 0=3
LayerNorm                ln_70                    1 1 75 76 0=36 1=1.000000e-06 2=1
Permute                  permute_92               1 1 76 77 0=4
Split                    splitncnn_7              1 2 77 78 79
Slice                    chunk_2                  1 4 78 80 81 82 83 -23300=4,-233,-233,-233,-233 1=0
ConvolutionDepthWise     convdw_147               1 1 80 84 0=9 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=81 7=9
Pooling                  amp_121                  1 1 81 85 0=0 18=257 7=1 8=360
ConvolutionDepthWise     convdw_148               1 1 85 86 0=9 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=81 7=9
Interp                   upsample_nearest_6       1 1 86 87 0=1 3=514 4=720 6=0
Pooling                  amp_122                  1 1 82 88 0=0 18=128 7=1 8=180
ConvolutionDepthWise     convdw_149               1 1 88 89 0=9 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=81 7=9
Interp                   upsample_nearest_7       1 1 89 90 0=1 3=514 4=720 6=0
Pooling                  amp_123                  1 1 83 91 0=0 18=64 7=1 8=90
ConvolutionDepthWise     convdw_150               1 1 91 92 0=9 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=81 7=9
Interp                   upsample_nearest_8       1 1 92 93 0=1 3=514 4=720 6=0
Concat                   cat_2                    4 1 84 87 90 93 94 0=0
Convolution              conv_31                  1 1 94 95 0=36 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1296
GELU                     gelu_54                  1 1 95 96
BinaryOp                 mul_6                    2 1 96 79 97 0=2
BinaryOp                 add_7                    2 1 97 73 98 0=0
Split                    splitncnn_8              1 2 98 99 100
Permute                  permute_93               1 1 100 101 0=3
LayerNorm                ln_71                    1 1 101 102 0=36 1=1.000000e-06 2=1
Permute                  permute_94               1 1 102 103 0=4
Convolution              conv_32                  1 1 103 104 0=72 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=23328
GELU                     gelu_55                  1 1 104 105
Convolution              conv_33                  1 1 105 106 0=36 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2592
BinaryOp                 add_8                    2 1 106 99 107 0=0
Split                    splitncnn_9              1 2 107 108 109
Permute                  permute_95               1 1 109 110 0=3
LayerNorm                ln_72                    1 1 110 111 0=36 1=1.000000e-06 2=1
Permute                  permute_96               1 1 111 112 0=4
Split                    splitncnn_10             1 2 112 113 114
Slice                    chunk_3                  1 4 113 115 116 117 118 -23300=4,-233,-233,-233,-233 1=0
ConvolutionDepthWise     convdw_151               1 1 115 119 0=9 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=81 7=9
Pooling                  amp_124                  1 1 116 120 0=0 18=257 7=1 8=360
ConvolutionDepthWise     convdw_152               1 1 120 121 0=9 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=81 7=9
Interp                   upsample_nearest_9       1 1 121 122 0=1 3=514 4=720 6=0
Pooling                  amp_125                  1 1 117 123 0=0 18=128 7=1 8=180
ConvolutionDepthWise     convdw_153               1 1 123 124 0=9 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=81 7=9
Interp                   upsample_nearest_10      1 1 124 125 0=1 3=514 4=720 6=0
Pooling                  amp_126                  1 1 118 126 0=0 18=64 7=1 8=90
ConvolutionDepthWise     convdw_154               1 1 126 127 0=9 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=81 7=9
Interp                   upsample_nearest_11      1 1 127 128 0=1 3=514 4=720 6=0
Concat                   cat_3                    4 1 119 122 125 128 129 0=0
Convolution              conv_34                  1 1 129 130 0=36 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1296
GELU                     gelu_56                  1 1 130 131
BinaryOp                 mul_9                    2 1 131 114 132 0=2
BinaryOp                 add_10                   2 1 132 108 133 0=0
Split                    splitncnn_11             1 2 133 134 135
Permute                  permute_97               1 1 135 136 0=3
LayerNorm                ln_73                    1 1 136 137 0=36 1=1.000000e-06 2=1
Permute                  permute_98               1 1 137 138 0=4
Convolution              conv_35                  1 1 138 139 0=72 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=23328
GELU                     gelu_57                  1 1 139 140
Convolution              conv_36                  1 1 140 141 0=36 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2592
BinaryOp                 add_11                   2 1 141 134 142 0=0
Split                    splitncnn_12             1 2 142 143 144
Permute                  permute_99               1 1 144 145 0=3
LayerNorm                ln_74                    1 1 145 146 0=36 1=1.000000e-06 2=1
Permute                  permute_100              1 1 146 147 0=4
Split                    splitncnn_13             1 2 147 148 149
Slice                    chunk_4                  1 4 148 150 151 152 153 -23300=4,-233,-233,-233,-233 1=0
ConvolutionDepthWise     convdw_155               1 1 150 154 0=9 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=81 7=9
Pooling                  amp_127                  1 1 151 155 0=0 18=257 7=1 8=360
ConvolutionDepthWise     convdw_156               1 1 155 156 0=9 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=81 7=9
Interp                   upsample_nearest_12      1 1 156 157 0=1 3=514 4=720 6=0
Pooling                  amp_128                  1 1 152 158 0=0 18=128 7=1 8=180
ConvolutionDepthWise     convdw_157               1 1 158 159 0=9 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=81 7=9
Interp                   upsample_nearest_13      1 1 159 160 0=1 3=514 4=720 6=0
Pooling                  amp_129                  1 1 153 161 0=0 18=64 7=1 8=90
ConvolutionDepthWise     convdw_158               1 1 161 162 0=9 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=81 7=9
Interp                   upsample_nearest_14      1 1 162 163 0=1 3=514 4=720 6=0
Concat                   cat_4                    4 1 154 157 160 163 164 0=0
Convolution              conv_37                  1 1 164 165 0=36 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1296
GELU                     gelu_58                  1 1 165 166
BinaryOp                 mul_12                   2 1 166 149 167 0=2
BinaryOp                 add_13                   2 1 167 143 168 0=0
Split                    splitncnn_14             1 2 168 169 170
Permute                  permute_101              1 1 170 171 0=3
LayerNorm                ln_75                    1 1 171 172 0=36 1=1.000000e-06 2=1
Permute                  permute_102              1 1 172 173 0=4
Convolution              conv_38                  1 1 173 174 0=72 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=23328
GELU                     gelu_59                  1 1 174 175
Convolution              conv_39                  1 1 175 176 0=36 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2592
BinaryOp                 add_14                   2 1 176 169 177 0=0
Split                    splitncnn_15             1 2 177 178 179
Permute                  permute_103              1 1 179 180 0=3
LayerNorm                ln_76                    1 1 180 181 0=36 1=1.000000e-06 2=1
Permute                  permute_104              1 1 181 182 0=4
Split                    splitncnn_16             1 2 182 183 184
Slice                    chunk_5                  1 4 183 185 186 187 188 -23300=4,-233,-233,-233,-233 1=0
ConvolutionDepthWise     convdw_159               1 1 185 189 0=9 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=81 7=9
Pooling                  amp_130                  1 1 186 190 0=0 18=257 7=1 8=360
ConvolutionDepthWise     convdw_160               1 1 190 191 0=9 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=81 7=9
Interp                   upsample_nearest_15      1 1 191 192 0=1 3=514 4=720 6=0
Pooling                  amp_131                  1 1 187 193 0=0 18=128 7=1 8=180
ConvolutionDepthWise     convdw_161               1 1 193 194 0=9 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=81 7=9
Interp                   upsample_nearest_16      1 1 194 195 0=1 3=514 4=720 6=0
Pooling                  amp_132                  1 1 188 196 0=0 18=64 7=1 8=90
ConvolutionDepthWise     convdw_162               1 1 196 197 0=9 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=81 7=9
Interp                   upsample_nearest_17      1 1 197 198 0=1 3=514 4=720 6=0
Concat                   cat_5                    4 1 189 192 195 198 199 0=0
Convolution              conv_40                  1 1 199 200 0=36 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1296
GELU                     gelu_60                  1 1 200 201
BinaryOp                 mul_15                   2 1 201 184 202 0=2
BinaryOp                 add_16                   2 1 202 178 203 0=0
Split                    splitncnn_17             1 2 203 204 205
Permute                  permute_105              1 1 205 206 0=3
LayerNorm                ln_77                    1 1 206 207 0=36 1=1.000000e-06 2=1
Permute                  permute_106              1 1 207 208 0=4
Convolution              conv_41                  1 1 208 209 0=72 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=23328
GELU                     gelu_61                  1 1 209 210
Convolution              conv_42                  1 1 210 211 0=36 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2592
BinaryOp                 add_17                   2 1 211 204 212 0=0
Split                    splitncnn_18             1 2 212 213 214
Permute                  permute_107              1 1 214 215 0=3
LayerNorm                ln_78                    1 1 215 216 0=36 1=1.000000e-06 2=1
Permute                  permute_108              1 1 216 217 0=4
Split                    splitncnn_19             1 2 217 218 219
Slice                    chunk_6                  1 4 218 220 221 222 223 -23300=4,-233,-233,-233,-233 1=0
ConvolutionDepthWise     convdw_163               1 1 220 224 0=9 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=81 7=9
Pooling                  amp_133                  1 1 221 225 0=0 18=257 7=1 8=360
ConvolutionDepthWise     convdw_164               1 1 225 226 0=9 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=81 7=9
Interp                   upsample_nearest_18      1 1 226 227 0=1 3=514 4=720 6=0
Pooling                  amp_134                  1 1 222 228 0=0 18=128 7=1 8=180
ConvolutionDepthWise     convdw_165               1 1 228 229 0=9 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=81 7=9
Interp                   upsample_nearest_19      1 1 229 230 0=1 3=514 4=720 6=0
Pooling                  amp_135                  1 1 223 231 0=0 18=64 7=1 8=90
ConvolutionDepthWise     convdw_166               1 1 231 232 0=9 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=81 7=9
Interp                   upsample_nearest_20      1 1 232 233 0=1 3=514 4=720 6=0
Concat                   cat_6                    4 1 224 227 230 233 234 0=0
Convolution              conv_43                  1 1 234 235 0=36 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1296
GELU                     gelu_62                  1 1 235 236
BinaryOp                 mul_18                   2 1 236 219 237 0=2
BinaryOp                 add_19                   2 1 237 213 238 0=0
Split                    splitncnn_20             1 2 238 239 240
Permute                  permute_109              1 1 240 241 0=3
LayerNorm                ln_79                    1 1 241 242 0=36 1=1.000000e-06 2=1
Permute                  permute_110              1 1 242 243 0=4
Convolution              conv_44                  1 1 243 244 0=72 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=23328
GELU                     gelu_63                  1 1 244 245
Convolution              conv_45                  1 1 245 246 0=36 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2592
BinaryOp                 add_20                   2 1 246 239 247 0=0
Split                    splitncnn_21             1 2 247 248 249
Permute                  permute_111              1 1 249 250 0=3
LayerNorm                ln_80                    1 1 250 251 0=36 1=1.000000e-06 2=1
Permute                  permute_112              1 1 251 252 0=4
Split                    splitncnn_22             1 2 252 253 254
Slice                    chunk_7                  1 4 253 255 256 257 258 -23300=4,-233,-233,-233,-233 1=0
ConvolutionDepthWise     convdw_167               1 1 255 259 0=9 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=81 7=9
Pooling                  amp_136                  1 1 256 260 0=0 18=257 7=1 8=360
ConvolutionDepthWise     convdw_168               1 1 260 261 0=9 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=81 7=9
Interp                   upsample_nearest_21      1 1 261 262 0=1 3=514 4=720 6=0
Pooling                  amp_137                  1 1 257 263 0=0 18=128 7=1 8=180
ConvolutionDepthWise     convdw_169               1 1 263 264 0=9 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=81 7=9
Interp                   upsample_nearest_22      1 1 264 265 0=1 3=514 4=720 6=0
Pooling                  amp_138                  1 1 258 266 0=0 18=64 7=1 8=90
ConvolutionDepthWise     convdw_170               1 1 266 267 0=9 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=81 7=9
Interp                   upsample_nearest_23      1 1 267 268 0=1 3=514 4=720 6=0
Concat                   cat_7                    4 1 259 262 265 268 269 0=0
Convolution              conv_46                  1 1 269 270 0=36 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1296
GELU                     gelu_64                  1 1 270 271
BinaryOp                 mul_21                   2 1 271 254 272 0=2
BinaryOp                 add_22                   2 1 272 248 273 0=0
Split                    splitncnn_23             1 2 273 274 275
Permute                  permute_113              1 1 275 276 0=3
LayerNorm                ln_81                    1 1 276 277 0=36 1=1.000000e-06 2=1
Permute                  permute_114              1 1 277 278 0=4
Convolution              conv_47                  1 1 278 279 0=72 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=23328
GELU                     gelu_65                  1 1 279 280
Convolution              conv_48                  1 1 280 281 0=36 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2592
BinaryOp                 add_23                   2 1 281 274 282 0=0
BinaryOp                 add_24                   2 1 282 3 283 0=0
Convolution              conv_49                  1 1 283 284 0=12 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=3888
PixelShuffle             pixelshuffle_82          1 1 284 out0 0=2 1=0
